ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
NRF_BLE_SCAN_DEF(m_scan);                                                       /**< Scanning module instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
BLE_LBS_C_ARRAY_DEF(m_ble_lbs_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT);               /**< LED button client instances. */
BLE_DB_DISCOVERY_ARRAY_DEF(m_db_disc, NRF_SDH_BLE_CENTRAL_LINK_COUNT);          /**< Database discovery module instances. */

static char const m_target_periph_name_left[] = "Left_Peripheral";              /**< Name of the device we try to connect to. This name is searched in the scan report data*/
static char const m_target_periph_name_right[] = "Right_Peripheral";

static nrf_saadc_value_t m_buffer[SAMPLES_IN_BUFFER];

uint8_t  rect_status  = 0;
uint8_t  object_close = 0;
uint8_t  object_left = 0;
uint8_t  object_right = 0;
uint8_t  draw_right   = 0;
uint8_t  draw_left    = 0;
uint8_t  draw_text    = 0;
uint8_t  curr_drift   = 0;
uint32_t distance     = 0;
uint32_t atd_result   = 0;
uint32_t drift_error  = 0;
uint32_t draw_ble     = 1;
int8_t left_conn_handle = -1;
int8_t right_conn_handle = -1;

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

nrf_gfx_rect_t test_rect = NRF_GFX_RECT(10,100,20,150);

nrfx_timer_t timer_us = NRFX_TIMER_INSTANCE(2);
APP_PWM_INSTANCE(PWM1,3);                   // Create the instance "PWM1" using TIMER2.

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

char * close = "CLOSE";
char * far = "FAR";
const char * text = "";

extern const nrf_gfx_font_desc_t orkney_24ptFontInfo;
extern nrf_lcd_t nrf_lcd_ili9341;
nrf_lcd_t* lcd = &nrf_lcd_ili9341;
static const nrf_gfx_font_desc_t * p_font = &orkney_24ptFontInfo;

//Graphics init for the 2 lane lines
int offset = 100;
int width = 20;
int height = 40;

//Drifting flags
int draw_r1;
int draw_r2;
int draw_r3;
int draw_l1;
int draw_l2;
int draw_l3;

//Flags for speaker
int sound_object = 0;
int sound_drift_left = 0;
int sound_drift_right = 0;
float volume;

//Volume SAADC variables
nrf_saadc_value_t p_value = 0;
static nrf_saadc_value_t m_buffer[SAMPLES_IN_BUFFER];

//Graphics Init for the bluetooth Logo
#define SCALE     8
#define START_RX  30
#define START_RY  40
#define START_LX  START_RX
#define START_LY  320 - START_RY + SCALE*2
#define THICKNESS 4

//Graphics for the Red Circle over the logos
#define circ_thick 5

/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/************************************************
* Gets called when SAADC is invoked 
* (nrf_drv_saadc_sample()) in timer interrupt
************************************************/
void saadc_callback(nrfx_saadc_evt_t const * p_event)
{
    if (p_event->type == NRFX_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        err_code = nrfx_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);
        p_value = p_event->data.done.p_buffer[0];

        //NRF_LOG_INFO("Volume: %d", p_value);
        if(p_value < 0){
          p_value = 0;
        }
        volume = 50 * (p_value / 1024.0);
        NRF_LOG_INFO("Volume: %d", volume);

    }
}

/************************************************
* Initializes ATD to sample analog input 6
************************************************/
void saadc_init(void)
{
    ret_code_t err_code;
    static const nrfx_saadc_config_t default_config = NRFX_SAADC_DEFAULT_CONFIG;
    nrf_saadc_channel_config_t channel_config 
        = NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN5);
    
    //channel_config.gain = NRF_SAADC_GAIN1;

    err_code = nrfx_saadc_init(&default_config, saadc_callback);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_saadc_channel_init(0, &channel_config);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_saadc_buffer_convert(m_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(err_code);
}

static volatile bool ready_flag;            // A flag indicating PWM status.

void pwm_ready_callback(uint32_t pwm_id)    // PWM callback function
{
    ready_flag = true;
}

void pwm_init(void){
    ret_code_t err_code;
    
    /* 2-channel PWM, 200Hz, output on DK LED pins. */
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_1CH(5000L, SPEAKER_PIN);

    /* Switch the polarity of the second channel. */
    pwm1_cfg.pin_polarity[0] = APP_PWM_POLARITY_ACTIVE_HIGH;

    /* Initialize and enable PWM. */
    err_code = app_pwm_init(&PWM1,&pwm1_cfg,pwm_ready_callback);
    APP_ERROR_CHECK(err_code);
    app_pwm_enable(&PWM1);

    //app_pwm_channel_duty_set(&PWM1, 0, 0);
    //app_pwm_channel_duty_set(&PWM1, 0, 50);
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;
    int value;

    // For readability.
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    int conn_count = ble_conn_state_central_conn_count();

    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected (HR or RSC), initiate DB
        // discovery, update LEDs status and resume scanning if necessary. */
        case BLE_GAP_EVT_ADV_REPORT:
        {
           ble_gap_evt_adv_report_t const * const p_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;

           if(ble_advdata_name_find(p_adv_report->data.p_data,
                                  p_adv_report->data.len,
                                  m_target_periph_name_left)){
             NRF_LOG_INFO("FOUND LEFT");
             if(right_conn_handle == -1){
               left_conn_handle = 0;
             }else{
               left_conn_handle = 1;
             }
           }else if(ble_advdata_name_find(p_adv_report->data.p_data,
                                  p_adv_report->data.len,
                                  m_target_periph_name_right)){
             NRF_LOG_INFO("FOUND RIGHT");
             right_conn_handle = p_gap_evt->conn_handle;
              if(left_conn_handle == -1){
                right_conn_handle = 0;
              }else{
                right_conn_handle = 1;
              }
           }

