ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrfx_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrfx_gpiote_in_config_t in_config = NRFX_GPIOTE_CONFIG_IN_SENSE_TOGGLE(true);
    in_config.pull = NRF_GPIO_PIN_PULLDOWN;

    err_code = nrfx_gpiote_in_init(DRIFT_LEFT_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_gpiote_in_init(DRIFT_RIGHT_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_gpiote_in_init(ERROR_PIN, &in_config, (nrfx_gpiote_evt_handler_t) drifting_gpio_handler);
    APP_ERROR_CHECK(err_code);

    nrf_gpio_cfg_output(LEFT_LED);
    nrf_gpio_cfg_output(RIGHT_LED);

    nrfx_gpiote_in_event_enable(DRIFT_LEFT_PIN, true);
    nrfx_gpiote_in_event_enable(DRIFT_RIGHT_PIN, true);
    nrfx_gpiote_in_event_enable(ERROR_PIN, true);

    //nrf_gpio_cfg_output(17);
    //nrf_gpio_pin_write(17,0);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
    NRF_LOG_FLUSH();
    nrf_pwr_mgmt_run();
}


/**@brief Handles events coming from the LED Button central module.
 */
static void lbs_c_evt_handler(ble_lbs_c_t * p_lbs_c, ble_lbs_c_evt_t * p_lbs_c_evt)
{
    switch (p_lbs_c_evt->evt_type)
    {
        case BLE_LBS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

//            err_code = ble_lbs_c_handles_assign(&m_ble_lbs_c,
//                                                p_lbs_c_evt->conn_handle,
//                                                &p_lbs_c_evt->params.peer_db);
            NRF_LOG_INFO("LED Button service discovered on conn_handle 0x%x.", p_lbs_c_evt->conn_handle);

            // LED Button service discovered. Enable notification of Button.
            err_code = ble_lbs_c_button_notif_enable(p_lbs_c);
            APP_ERROR_CHECK(err_code);
        } break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_LBS_C_EVT_BUTTON_NOTIFICATION:
        {
            draw_text = 1;
            NRF_LOG_INFO("Button state changed on peer to 0x%x.", p_lbs_c_evt->params.button.button_state);
              /************************************************
              * Actions if received "CLOSE" message from
              * peripheral micro:
              * 1. Change text to "Close"
              * 2. Change LED Status
              ************************************************/
              if (p_lbs_c_evt->params.button.button_state)
              {
                  object_close = 1;
                  sound_object = 1;
                  text = close;
                  if(p_lbs_c_evt->conn_handle == left_conn_handle){
                    object_left = 1;
                    nrf_gpio_pin_write(LEFT_LED,1);
                  }else if(p_lbs_c_evt->conn_handle == right_conn_handle){
                    object_right = 1;
                    nrf_gpio_pin_write(RIGHT_LED,1);
                  }
                  NRF_LOG_INFO("Received LED ON!");
              }
              /************************************************
              * Actions if received "FAR" message from
              * peripheral micro:
              * 1. Change text to "Far"
              * 2. Change LED Status
              ************************************************/
              else
              {
                  object_close = 0;
                  sound_object = 0;
                  text = far;
                  if(p_lbs_c_evt->conn_handle == left_conn_handle){
                    object_left = 0;
                    nrf_gpio_pin_write(LEFT_LED,0);
                  }else if(p_lbs_c_evt->conn_handle == right_conn_handle){
                    object_right = 0;
                    nrf_gpio_pin_write(RIGHT_LED,0);
                  }
                  NRF_LOG_INFO("Received LED OFF!");
              }
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION

        default:
            // No implementation needed.
            break;
    }
}

/**@brief LED Button client initialization.
 */
static void lbs_c_init(void)
{
    ret_code_t       err_code;
    ble_lbs_c_init_t lbs_c_init_obj;

    lbs_c_init_obj.evt_handler = lbs_c_evt_handler;

    //Initialize 2 central roles to find the peripherals
    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_lbs_c_init(&m_ble_lbs_c[i], &lbs_c_init_obj);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for initializing the log.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing the Power manager. */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;

    switch(p_scan_evt->scan_evt_id)
    {
        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        default:
          break;
    }
}

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = true;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Setting filters for scanning.
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name_left);
    APP_ERROR_CHECK(err_code);

