ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name_right);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

nrfx_timer_event_handler_t drift_handle(void){
    ret_code_t err_code;
    if(draw_right){
      if(draw_r1){
        draw_r1 = 0;
        draw_r2 = 1;
      }
      else if(draw_r2){
        draw_r2 = 0;
        draw_r3 = 1;
      }
      else if(draw_r3){
        draw_r3 = 0;
        draw_r1 = 1;
      }
    }
    if(draw_left){
      if(draw_l1){
        draw_l1 = 0;
        draw_l2 = 1;
      }
      else if(draw_l2){
        draw_l2 = 0;
        draw_l3 = 1;
      }
      else if(draw_l3){
        draw_l3 = 0;
        draw_l1 = 1;
      }
    }
//    nrfx_saadc_sample();
    NRF_LOG_FLUSH();
    nrfx_timer_clear(&timer_us);
   
}

/************************************************
* Initializes timer to conduct ATD 20 times a
* second (compare 1563)
************************************************/
void simple_timer_init(void){
    const nrfx_timer_config_t timer_config = {
    .frequency = NRF_TIMER_FREQ_31250Hz,
    .bit_width = NRF_TIMER_BIT_WIDTH_24,
    .interrupt_priority = 6,
    .mode = NRF_TIMER_MODE_TIMER,
    .p_context = NULL
    };

    nrfx_timer_init(&timer_us, &timer_config, (nrfx_timer_event_handler_t) drift_handle);
    //nrfx_timer_compare(&timer_us, 0, 1563, true);

    //Timer interrupt at 4 Hz
    nrfx_timer_compare(&timer_us, 0, 6000, true);
    
    nrfx_timer_enable(&timer_us);
}

static void screen_clear(void)
{ 
    nrf_gfx_screen_fill(lcd, GRAY);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
} 

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void draw_circle(bool left, bool red){

    //Graphics for the Red Circle over the logos
    nrf_gfx_line_t l_line_red = NRF_GFX_LINE(START_LX,START_LY - SCALE*3,START_LX + SCALE*2,START_LY + SCALE,circ_thick);
    nrf_gfx_circle_t l_circle = NRF_GFX_CIRCLE((START_LX + (START_LX + SCALE*2)) / 2, (START_LY - SCALE*3 + (START_LY + SCALE)) / 2, SCALE*3);
    
    nrf_gfx_line_t r_line_red = NRF_GFX_LINE(START_RX,START_RY - SCALE*3,START_RX + SCALE*2,START_RY + SCALE,circ_thick);
    nrf_gfx_circle_t r_circle = NRF_GFX_CIRCLE((START_RX + (START_RX + SCALE*2)) / 2, (START_RY - SCALE*3 + (START_RY + SCALE)) / 2, SCALE*3);

    nrf_gfx_circle_t circle;
    nrf_gfx_line_t line;

    int color;
    if(red){
      color = RED;
    }else{
      color = GRAY;
    }

    if(left){
      circle = l_circle;
      line = l_line_red;
    }else{
      circle = r_circle;
      line = r_line_red;
    }
    nrf_gfx_line_draw(lcd, &line, color);
    for(int i = 0; i < circ_thick; i++){
      circle.r--;
      nrf_gfx_circle_draw(lcd, &circle, color, false);
    }
    circle.r = SCALE*3;
}

static void draw_ble_logo(bool left, bool connected){

    //Graphics Init for the bluetooth Logo
    nrf_gfx_line_t blue_r1 = NRF_GFX_LINE(START_RX,START_RY,START_RX + SCALE*2,START_RY-SCALE*2,THICKNESS);
    nrf_gfx_line_t blue_r2 = NRF_GFX_LINE(START_RX + SCALE*2,START_RY - SCALE*2,START_RX + SCALE*3,START_RY - SCALE*1,THICKNESS);
    nrf_gfx_line_t blue_r3 = NRF_GFX_LINE(START_RX - SCALE*1,START_RY - SCALE*1,START_RX + SCALE*3 + THICKNESS,START_RY - SCALE*1,THICKNESS);
    nrf_gfx_line_t blue_r4 = NRF_GFX_LINE(START_RX - SCALE*1,START_RY - SCALE*1,START_RX + SCALE*0,START_RY - SCALE*2,THICKNESS);
    nrf_gfx_line_t blue_r5 = NRF_GFX_LINE(START_RX + SCALE*0,START_RY - SCALE*2,START_RX + SCALE*2,START_RY - SCALE*0,THICKNESS);

    nrf_gfx_line_t blue_l1 = NRF_GFX_LINE(START_LX,START_LY,START_LX + SCALE*2,START_LY-SCALE*2,THICKNESS);
    nrf_gfx_line_t blue_l2 = NRF_GFX_LINE(START_LX + SCALE*2,START_LY - SCALE*2,START_LX + SCALE*3,START_LY - SCALE*1,THICKNESS);
    nrf_gfx_line_t blue_l3 = NRF_GFX_LINE(START_LX - SCALE*1,START_LY - SCALE*1,START_LX + SCALE*3 + THICKNESS,START_LY - SCALE*1,THICKNESS);
    nrf_gfx_line_t blue_l4 = NRF_GFX_LINE(START_LX - SCALE*1,START_LY - SCALE*1,START_LX + SCALE*0,START_LY - SCALE*2,THICKNESS);
    nrf_gfx_line_t blue_l5 = NRF_GFX_LINE(START_LX + SCALE*0,START_LY - SCALE*2,START_LX + SCALE*2,START_LY - SCALE*0,THICKNESS);

    if(left){
      draw_circle(left, false);
      nrf_gfx_line_draw(lcd, &blue_l1,BLUE);
      nrf_gfx_line_draw(lcd, &blue_l2,BLUE);
      nrf_gfx_line_draw(lcd, &blue_l3,BLUE);
      nrf_gfx_line_draw(lcd, &blue_l4,BLUE);
      nrf_gfx_line_draw(lcd, &blue_l5,BLUE);
    }else{
      draw_circle(left,false);
      nrf_gfx_line_draw(lcd, &blue_r1,BLUE);
      nrf_gfx_line_draw(lcd, &blue_r2,BLUE);
      nrf_gfx_line_draw(lcd, &blue_r3,BLUE);
      nrf_gfx_line_draw(lcd, &blue_r4,BLUE);
      nrf_gfx_line_draw(lcd, &blue_r5,BLUE);
    }

    if(!connected){
       draw_circle(left,true);
    }
}

int main(void)
{ 
    bsp_board_init(BSP_INIT_LEDS);

//  Initialize modules.
    gpio_init();
    log_init();
    timers_init();
    pwm_init();
    nrf_gfx_init(lcd);
    power_management_init();
    simple_timer_init();
    //saadc_init();

    //BLE init
    ble_stack_init();
    gatt_init();
    db_discovery_init();
    lbs_c_init();
    ble_conn_state_init();
    scan_init();
   
    // Start execution.
    NRF_LOG_INFO("Main Code started.");
    screen_clear();

    //Initialize the Screen
    nrf_gfx_rect_t wipe_text = NRF_GFX_RECT(5, nrf_gfx_height_get(lcd) - 50, nrf_gfx_width_get(lcd), 40); //Creating the wipe text rectangle
    uint32_t value;

    //Graphics init for the 2 lane lines
    //They are numbered Backwards to draw them from bottom to top
    nrf_gfx_rect_t right_rect_3 = NRF_GFX_RECT(50,offset,height,width);
    nrf_gfx_rect_t right_rect_2 = NRF_GFX_RECT(100,offset,height,width);
    nrf_gfx_rect_t right_rect_1 = NRF_GFX_RECT(150,offset,height,width);
    nrf_gfx_rect_t left_rect_3 =  NRF_GFX_RECT(50,320-offset-width,height,width);
    nrf_gfx_rect_t left_rect_2 =  NRF_GFX_RECT(100,320-offset-width,height,width);
    nrf_gfx_rect_t left_rect_1 =  NRF_GFX_RECT(150,320-offset-width,height,width);

    nrf_gfx_rect_t right_rect_red_3 = NRF_GFX_RECT(50 +THICKNESS,offset+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);
    nrf_gfx_rect_t right_rect_red_2 = NRF_GFX_RECT(100+THICKNESS,offset+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);
    nrf_gfx_rect_t right_rect_red_1 = NRF_GFX_RECT(150+THICKNESS,offset+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);
    nrf_gfx_rect_t left_rect_red_3 =  NRF_GFX_RECT(50 +THICKNESS,320-offset-width+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);
    nrf_gfx_rect_t left_rect_red_2 =  NRF_GFX_RECT(100+THICKNESS,320-offset-width+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);
    nrf_gfx_rect_t left_rect_red_1 =  NRF_GFX_RECT(150+THICKNESS,320-offset-width+THICKNESS,height-THICKNESS*2,width-THICKNESS*2);

    scan_start();

    nrf_gfx_rect_draw(lcd, &left_rect_1,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &left_rect_2,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &left_rect_3,2,BLACK,false);

