ybharatu/Third_Eye_Not_Blind/NRF52_code/main_micro/main.c
    nrf_gfx_rect_draw(lcd, &right_rect_1,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &right_rect_2,2,BLACK,false);
    nrf_gfx_rect_draw(lcd, &right_rect_3,2,BLACK,false);
    
    while (true)
    {
      if(draw_ble == 1){
          draw_ble = 0;
          if (left_conn_handle != -1 && right_conn_handle != -1){
              draw_ble_logo(true,true);
              draw_ble_logo(false,true);
          }
          else if(left_conn_handle != -1){
              draw_ble_logo(true,true);
              draw_ble_logo(false,false);
          }
          else if(right_conn_handle != -1){
              draw_ble_logo(true,false);
              draw_ble_logo(false,true);
          }
          else{
              draw_ble_logo(true,false);
              draw_ble_logo(false,false);
          }
      }

      if((object_left && sound_drift_left) || (object_right && sound_drift_right)){
        /* Set the duty cycle - keep trying until PWM is ready... */
        NRF_LOG_INFO("OBJECT IS CLOSE. SHOULD MAKE NOISE!");
        ready_flag = false;
        
        while (app_pwm_channel_duty_set(&PWM1, 0, 50) == NRF_ERROR_BUSY);      
      }
      else{
          app_pwm_channel_duty_set(&PWM1, 0, 0);
      }
      if(!drift_error){
        if(rect_status == 0){
            //Draw the 2 Lane Rectangles
            rect_status = 1;
            nrf_gfx_rect_draw(lcd, &left_rect_1,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &left_rect_2,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &left_rect_3,2,GRAY,true);

            nrf_gfx_rect_draw(lcd, &right_rect_1,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &right_rect_2,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &right_rect_3,2,GRAY,true);

            nrf_gfx_rect_draw(lcd, &left_rect_1,2,BLACK,false);
            nrf_gfx_rect_draw(lcd, &left_rect_2,2,BLACK,false);
            nrf_gfx_rect_draw(lcd, &left_rect_3,2,BLACK,false);
                                              
            nrf_gfx_rect_draw(lcd, &right_rect_1,2,BLACK,false);
            nrf_gfx_rect_draw(lcd, &right_rect_2,2,BLACK,false);
            nrf_gfx_rect_draw(lcd, &right_rect_3,2,BLACK,false);
        }
        if(draw_right){
            if(draw_r1){
              nrf_gfx_rect_draw(lcd, &right_rect_red_1,2,RED,true);
              nrf_gfx_rect_draw(lcd, &right_rect_red_3,2,GRAY,true);
            }
            if(draw_r2){
              nrf_gfx_rect_draw(lcd, &right_rect_red_2,2,RED,true);
              nrf_gfx_rect_draw(lcd, &right_rect_red_1,2,GRAY,true);
            }
            if(draw_r3){
              nrf_gfx_rect_draw(lcd, &right_rect_red_3,2,RED,true);
              nrf_gfx_rect_draw(lcd, &right_rect_red_2,2,GRAY,true);
            }
        }
        else if(draw_left){
            if(draw_l1){
              nrf_gfx_rect_draw(lcd, &left_rect_red_1,2,RED,true);
              nrf_gfx_rect_draw(lcd, &left_rect_red_3,2,GRAY,true);
            }
            if(draw_l2){
              nrf_gfx_rect_draw(lcd, &left_rect_red_2,2,RED,true);
              nrf_gfx_rect_draw(lcd, &left_rect_red_1,2,GRAY,true);
            }
            if(draw_l3){
              nrf_gfx_rect_draw(lcd, &left_rect_red_3,2,RED,true);
              nrf_gfx_rect_draw(lcd, &left_rect_red_2,2,GRAY,true);
            }
        }
      }else{
          if(rect_status == 0){
            rect_status = 1;
            nrf_gfx_rect_draw(lcd, &left_rect_1,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &left_rect_2,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &left_rect_3,2,GRAY,true);

            nrf_gfx_rect_draw(lcd, &right_rect_1,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &right_rect_2,2,GRAY,true);
            nrf_gfx_rect_draw(lcd, &right_rect_3,2,GRAY,true);
          }
      }
      idle_state_handle();
    }

}
